/* Урок 3: Программируем на C++
 *
 * Задание 1
 *
 * По аналогии с предыдущим заданием напишите программу, выводящую в поток стандартного вывода текст Happy coding!.
 * После строки в поток нужно вывести endl. Если вы напишете что-нибудь не так, компилятор выдаст сообщение об ошибке.
 * Мы разберём их в одном из следующих уроков. Попробуйте не копировать команду, а набрать её самостоятельно. Если вы
 * забыли, в каком порядке писать символы, ничего страшного — обратитесь к тексту урока. Это можно сделать, не закрывая
 * задачу: нажмите на кнопку «T» в меню на боковой части экрана. Если ничего не получается — не расстраивайтесь, вы
 * всегда можете обратиться в поддержку. Для этого нужно нажать на кнопку чата в нижнем углу и описать проблему.
 */

#include <iostream>

using namespace std;

int main() {
    cout << "Happy coding!" << endl;
}
