/* Урок 2: Что такое C++ и зачем он нужен
 *
 * Задание 1
 *
 * Мы подготовили простую команду, которая выведет текст в окно результата. Оно находится в правой части тренажёра. Для
 * разнообразия мы заменили "Hello world" на другую фразу. В этой задаче не требуется писать код, всё уже готово. Чтобы
 * вернуться к исходному коду, нажмите на кнопку «Начать заново». После этого нажмите на кнопку «Проверить», чтобы сдать
 * задачу и перейти к следующему уроку. Если кнопки «Запустить» и «Проверить» неактивны или не работают, система
 * загружается. Попробуйте подождать немного и обновить страницу. Если проблема остаётся, обратитесь в поддержку. Чат
 * поддержки находится в нижнем углу экрана.
 */

#include <iostream>

using namespace std;

int main() {
    cout << "Hello, friend!" << endl;
}
